# GetTileGroupParent

## Description
Gets the tile resource parent of the specified tile group.

```pascal
FUNCTION GetTileGroupParent(groupHandle : HANDLE) : HANDLE;
```

```python

def vs.GetTileGroupParent(groupHandle):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|groupHandle|HANDLE|The group handle of which to get the tile resource parent.|

## Returns
The tile parent handle; nil otherwise.

## Examples
```pascal
tileHandle := GetTileGroupParent(groupHandle);
```

## See Also
VS Functions:
CreateTile| ShowEditTileDialog| ShowEditTileSettingsDialog| ShowNewTileDialog| GetTileGeometryGroup| BeginGroupN| AddTileGeometryObject| GetTileGroupParent| IsTileGroupContainedObject| GetTileBackgroundColor| SetTileBackgroundColor| GetTileRepetitionPoint| SetTileRepetitionPoint| GetTileOffsetPoint| SetTileOffsetPoint

## Version
Availability: from Vectorworks 2011
## Category
* Document Attributes